# Environment Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroModule..::..Environment Property
MacroModule Class See Also
---
The Macro environment.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public MacroEnvironment Environment { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Environment As MacroEnvironment
	Get
```

Visual C++
---
```text
public:
property MacroEnvironment Environment {
	MacroEnvironment get ();
}
```

# See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace